---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AreaLoad
source: html/9f69392e-68c1-b74e-a8cf-cdfc10fe0e8d.htm
---
# AreaLoad Methods

Checks if curve loops are valid for creating an area load.